src/Sklad/cf/Enums/СтатусыЗаказовНаСборку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтатусыЗаказовНаСборку</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовКОтгрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгрузить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгружено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Sklad/cf/Enums/СтатусыЗаказовНаСборку/Ext/ManagerModule.bsl
#Область Брокер

Функция ВыгружаемыеСтатусы() Экспорт
	
	Результат = Новый Массив;
	
	Результат.Добавить(Перечисления.СтатусыЗаказовНаСборку.ГотовКОтгрузке);
	Результат.Добавить(Перечисления.СтатусыЗаказовНаСборку.Отгружено);
		
	Возврат Результат;	
	
КонецФункции  

Функция ДанныеОбъектаКВыгрузке(Объект) Экспорт
	
	// Упрощено чтоб не изобредать КД или БитАдаптер
	
	ПолноеИмя = Объект.Метаданные().ПолноеИмя();
	ДанныеОбъекта = ОбменСообщениямиПодготовкаСообщенияСервер.ШаблонСообщенияДляПреобразованияОбъектаВJSON();
    ДанныеОбъекта.ПолноеИмяОбъектаМетаданных = ПолноеИмя;
	
	ИндексЗначения = Перечисления.СтатусыЗаказовНаСборку.Индекс(Объект);
	Имя = Метаданные.Перечисления.СтатусыЗаказовНаСборку.ЗначенияПеречисления[ИндексЗначения].Имя;	
	
	Реквизиты = Новый Структура("Имя", Имя);
	
	ДанныеОбъекта.Реквизиты = Реквизиты;
	
	Возврат ДанныеОбъекта;	
	
КонецФункции 

#КонецОбласти
